#б) Задача. Визначити загальну вартість всіх товарів, випущених в поточному році і
#вивести інформацію про ці товари. Поля структури: Найменування, Виробник, Рік
#випуску, Кількість, Ціна. (Драч Ольга 122_Д)

sclad_dict = {}
n = int(input("Скільки товарів добавимо в склад? "))
for j in range(1,n+1):
    d = []
    for i in range(1):
        d = dict(найменування=input('Введите назву товару '),виробник =input('Введите виробника '),рік_випуску = int(input('Введите рік випуску ')),кількість= int(input('Введите кількість ')),ціна= int(input('Введите ціну ')))
    sclad_dict[j] = d
sum = 0
for i in sclad_dict:
    if sclad_dict[i].get('Рік_випуску ') == 2020:
        print(sclad_dict[i])
        sum += sclad_dict[i].get('ціна ')
print('Загальна вартість всіх товарів, випущених у поточному році ',sum)
